backend/controllers/ResourceClassController.php

SELECT * FROM `md_resource_class` WHERE `grade`=1 ORDER BY `id`
SELECT * FROM `md_resource_class` WHERE `parent`='1' ORDER BY `sort`
SELECT * FROM `md_resource_class` WHERE `parent`='7' ORDER BY `sort`
---
    protected function getTreeMenu()
    {
        $strHtml = "<ul>";
        $parents = ResourceClass::find()
            ->where(['grade' => 1])
            ->orderBy('id')
            ->all();

        foreach($parents as $parent)
        {
            $childLevel1s = ResourceClass::find()
                ->where(['parent' => $parent->id])
                ->orderBy('sort')
                ->all();

            if($childLevel1s)
            {
                $strHtml = $strHtml."<li uid='".$parent->id."' sort='".$parent->sort."' grade='"
                    .$parent->grade."'>"
                    .$parent->name."<ul>";
                foreach($childLevel1s as $childLevel1)
                {
                    $childLevel2s = ResourceClass::find()
                        ->where(['parent' => $childLevel1->id])
                        ->orderBy('sort')
                        ->all();