backend/config/main.php

            'on afterLogin' => function($event) {
                $user = $event->identity;
                $user->updated_at = time(); //登录后更新最后登录时间
                $user->save();
---
UPDATE `md_user` SET `updated_at`=1462848607 WHERE `id`=1