<?php
return [
    'member' => [
        /*医生职称*/
        'rank' => [
            '0' => '营养师',
            '1' => '职业药师',
            '2' => '药师',
            '3' => '店员',
            '4' => '店长',
            '5' => '店长助理',
        ],
        /*默认密码*/
        'defaultPwd' => '123456',
    ],
    /*通用状态选项*/
    'statusOption' => [
        '1' => '启用',
        '0' => '禁用',
    ],
    /*题库配置项*/
    'exercise' => [
        'type' => [
            '1' => '单选',
            '2' => '多选',
        ],
    ],
    /*分页每页显示条数*/
    'pageSize' => 20,
];
